app/controllers/application_controller.rb

    def user
        User.find(session[:uid].to_i)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]